import '../AccountManagementUI/TransactionsTable.css'
export default function TransactionsTable() {
      const data = [
    {
      type: "واریز",
      accountNumber: "43315987363",
      holder: "فاطمه احمدی",
      amount: "31,440,000",
      date: "1403/02/06 - 21:15",
      ref: "12345678",
      status: "موفق",
      icon: "🖐️",
    },
    {
      type: "برداشت",
      accountNumber: "7653791083",
      holder: "محمدرضا قاسمی",
      amount: "39,110,000",
      date: "1403/02/06 - 15:13",
      ref: "23456789",
      status: "موفق",
      icon: "🎁",
    },
    {
      type: "برداشت",
      accountNumber: "9876543210",
      holder: "علی عباسی",
      amount: "192,350,000",
      date: "1403/02/03 - 12:12",
      ref: "34567890",
      status: "ناموفق",
      icon: "✈️",
    },
    {
      type: "خرید اینترنتی",
      accountNumber: "-",
      holder: "-",
      amount: "192,350,000",
      date: "1403/02/03 - 12:12",
      ref: "45678901",
      status: "ناموفق",
      icon: "🛒",
    },
    {
      type: "واریز",
      accountNumber: "8765433569",
      holder: "مجید اسدی",
      amount: "192,350,000",
      date: "1403/02/03 - 12:12",
      ref: "56789012",
      status: "ناموفق",
      icon: "🏦",
    },
    {
      type: "برداشت",
      accountNumber: "9876543210",
      holder: "سحر غلامی",
      amount: "67,820,000",
      date: "1403/2/21 - 11:12",
      ref: "67890123",
      status: "ناموفق",
      icon: "🏛️",
    },
  ];
    return(
        <div className="table">
            <div className="header-table">
                <h2>تراکنش‌های</h2>
                <div className="filter">
                    <span>فیلتر</span>
                    <div className="filter-svg">
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="18" viewBox="0 0 16 18" fill="none">
                            <path d="M13.3333 9.83333C13.3333 10.1783 13.0533 10.4583 12.7083 10.4583H12.2916V10.875C12.2916 11.22 12.0116 11.5 11.6666 11.5C11.3216 11.5 11.0416 11.22 11.0416 10.875V10.4583H10.625C10.28 10.4583 9.99998 10.1783 9.99998 9.83333C9.99998 9.48833 10.28 9.20833 10.625 9.20833H11.0416V8.79167C11.0416 8.44667 11.3216 8.16667 11.6666 8.16667C12.0116 8.16667 12.2916 8.44667 12.2916 8.79167V9.20833H12.7083C13.0533 9.20833 13.3333 9.48833 13.3333 9.83333ZM15.625 9.83333C15.625 12.0158 13.8491 13.7917 11.6666 13.7917C10.985 13.7917 10.3525 13.6025 9.79165 13.2975V16.5C9.79165 16.7367 9.65828 16.9533 9.44578 17.0592C9.35828 17.1033 9.26165 17.125 9.16665 17.125C9.03415 17.125 8.90252 17.0825 8.79169 17L5.45835 14.5C5.30169 14.3817 5.20831 14.1967 5.20831 14V10.6667C5.20831 10.5008 5.14336 10.3442 5.02419 10.225L0.758341 5.95834C0.403341 5.60417 0.208313 5.13334 0.208313 4.63334V2.75C0.208313 1.71583 1.04998 0.875 2.08331 0.875H12.9166C13.95 0.875 14.7916 1.71583 14.7916 2.75V4.63334C14.7916 5.13334 14.5966 5.60418 14.2416 5.95918L13.7291 6.47167C14.8616 7.16834 15.625 8.40917 15.625 9.83333ZM8.54165 15.25V12.2342C8.02665 11.5658 7.70831 10.74 7.70831 9.83333C7.70831 7.65083 9.48415 5.875 11.6666 5.875C11.9433 5.875 12.2133 5.90418 12.4741 5.95918L13.3583 5.07501C13.4775 4.95667 13.5425 4.80001 13.5425 4.63334V2.75C13.5425 2.405 13.2616 2.125 12.9175 2.125H2.08413C1.73996 2.125 1.45913 2.405 1.45913 2.75V4.63334C1.45913 4.79917 1.52418 4.95584 1.64335 5.07501L5.9091 9.34167C6.2641 9.69584 6.45913 10.1667 6.45913 10.6667V13.6875L8.54165 15.25ZM14.375 9.83333C14.375 8.34 13.16 7.125 11.6666 7.125C10.1733 7.125 8.95831 8.34 8.95831 9.83333C8.95831 11.3267 10.1733 12.5417 11.6666 12.5417C13.16 12.5417 14.375 11.3267 14.375 9.83333Z" fill="#0C0C0C"/>
                        </svg>
                    </div>
                </div>
            </div>
            <div className="transaction">
                <table className="table-filter">
                    <thead className="thead-filter">
                        <tr>
                        <th>نوع تراکنش</th>
                        <th>شماره حساب</th>
                        <th>نام دارنده حساب</th>
                        <th>مبلغ</th>
                        <th>تاریخ</th>
                        <th>شماره رجاع</th>
                        <th>وضعیت</th>
                        </tr>
                    </thead>
                    <tbody>
                        {data.map((row, i) => (
                        <tr
                            key={i}
                            className=""
                        >
                            <td>{row.type}</td>
                            <td className="svg-bank">
                                <span>{row.icon}</span>
                                <span>{row.accountNumber}</span>
                            </td>
                            <td>{row.holder}</td>
                            <td>{row.amount} ریال</td>
                            <td>{row.date}</td>
                            <td>{row.ref}</td>
                            <td>
                            {row.status === "موفق" ? (
                                <span className="true">
                                موفق
                                </span>
                            ) : (
                                <span className="false">
                                ناموفق
                                </span>
                            )}
                            </td>
                        </tr>
                        ))}
                    </tbody>
                </table>
            </div>
            <ul className="screwer">
                <li>
                    <a href="#">
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" className="bi bi-chevron-right" viewBox="0 0 16 16">
                            <path fill-rule="evenodd" d="M4.646 1.646a.5.5 0 0 1 .708 0l6 6a.5.5 0 0 1 0 .708l-6 6a.5.5 0 0 1-.708-.708L10.293 8 4.646 2.354a.5.5 0 0 1 0-.708"/>
                        </svg>
                    </a>
                </li>
                <li>
                    <a href="#">1</a>
                </li>
                <li>
                    <a href="#">2</a>
                </li>
                <li>
                    <a href="#">3</a>
                </li>
                <li>
                    <a href="#">4</a>
                </li>
                <li>
                    <a href="#">
                        <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16"  className="bi bi-chevron-left" viewBox="0 0 16 16">
                            <path fill-rule="evenodd" d="M11.354 1.646a.5.5 0 0 1 0 .708L5.707 8l5.647 5.646a.5.5 0 0 1-.708.708l-6-6a.5.5 0 0 1 0-.708l6-6a.5.5 0 0 1 .708 0"/>
                        </svg>
                    </a>
                </li>
            </ul>
        </div>
    );
}